Show / Hide Table of Contents
Interface IBIMPluginHosting
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public interface IBIMPluginHosting
Properties
Improve this Doc   View Source
Service
Declaration
IApplicationBIM Service { get; }
Property Value
 Type |  Description
 IApplicationBIM
Methods
Improve this Doc   View Source
RunAsync(String, String)
Declaration
Task RunAsync(string id, string workingDirectory)
Parameters
 Type |  Name |  Description
 System.String |  id
 System.String |  workingDirectory
Returns
 Type |  Description
 System.Threading.Tasks.Task
Events
Improve this Doc   View Source
AppStatusChanged
Declaration
event ISEventHandler AppStatusChanged
Event Type
 Type |  Description
 ISEventHandler
 Improve this Doc
 View Source